//Задание 4
//        Написать программу, которая выведет на консоль «Hello world»,
//        не используя в исходном коде пробельных символов.

public class Task_4 {
    public static void main(String[] args) {
        char s = 32;
        System.out.println("Hello" + s + "world!!!");
    }
}
