//Задание 3
//        В переменной n хранится вещественное число,
//        с ненулевой дробной частью. Создайте программу,
//        округляющую число n до ближайшего целого и
//        выводящую результат округления на экран.

public class Task_3 {
    public static void main(String[] args) {
        double a = 3.541592;
        int b = (int)a;
        System.out.println(b);
    }
}
